Revit 2027 API
ParameterTypeId.RampAttrShape Property
 "Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RampAttrShape { get; }
Public Shared ReadOnly Property RampAttrShape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RampAttrShape {
	ForgeTypeId^ get ();
}
static member RampAttrShape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace